ДипломДубль/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>DefinedType.ТипСуммы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРабот</name>
    <type>
      <types>DefinedType.ТипСуммы</types>
    </type>
  </attributes>
</mdclass:Catalog>

ДипломДубль/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

ДипломДубль/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
///// ВКМ_ ( 
&НаСервере
Процедура ДобавитьДополнительныеРеквизиты()       
	
	МассивРеквизитов = Новый Массив;

	НовыйРеквизит1 = Новый РеквизитФормы("ДатаС", Новый ОписаниеТипов("Дата"), , "С ");  
	МассивРеквизитов.Добавить(НовыйРеквизит1);
	НовыйРеквизит2 = Новый РеквизитФормы("ДатаПо", Новый ОписаниеТипов("Дата"), , "По ");
	МассивРеквизитов.Добавить(НовыйРеквизит2);
	НовыйРеквизит3 = Новый РеквизитФормы("АбонентскаяПлата", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)), , "Абонентская плата");
	МассивРеквизитов.Добавить(НовыйРеквизит3);
	НовыйРеквизит4 = Новый РеквизитФормы("СтоимостьЧасаРабот", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,2)), , "Стоимость часа работ");
	МассивРеквизитов.Добавить(НовыйРеквизит4);
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	НовоеПоле1 = Элементы.Добавить("ПолеДатаС", Тип("ПолеФормы"));
	НовоеПоле1.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле1.ПутьКДанным = "ДатаС";   
	НовоеПоле1.УстановитьДействие("ПриИзменении", "ПриИзмененииДатаС");  

	
	НовоеПоле2 = Элементы.Добавить("ПолеДатаПо", Тип("ПолеФормы"));
	НовоеПоле2.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле2.ПутьКДанным = "ДатаПо";    
	НовоеПоле2.УстановитьДействие("ПриИзменении", "ПриИзмененииДатаПо");
	
	НовоеПоле3 = Элементы.Добавить("ПолеАбонентскаяПлата", Тип("ПолеФормы"));
	НовоеПоле3.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле3.ПутьКДанным = "АбонентскаяПлата";
	НовоеПоле3.УстановитьДействие("ПриИзменении", "ПриИзмененииАбонентскаяПлата");

	НовоеПоле4 = Элементы.Добавить("ПолеСтоимостьЧасаРабот", Тип("ПолеФормы"));
	НовоеПоле4.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле4.ПутьКДанным = "СтоимостьЧасаРабот";
	НовоеПоле4.УстановитьДействие("ПриИзменении", "ПриИзмененииСтоимостьЧасаРабот");      
	
	ЭтотОбъект.ДатаС = Объект.ВКМ_ДатаС;        
	ЭтотОбъект.ДатаПо = Объект.ВКМ_ДатаПо;
	ЭтотОбъект.АбонентскаяПлата = Объект.ВКМ_АбонентскаяПлата;
	ЭтотОбъект.СтоимостьЧасаРабот = Объект.ВКМ_СтоимостьЧасаРабот;
	
КонецПроцедуры	

&НаСервере
Процедура УдалитьДополнительныеРеквизиты()    
	
	УдалитьРеквизиты = Новый Массив;
	УдалитьРеквизиты.Добавить("ДатаС");
	УдалитьРеквизиты.Добавить("ДатаПо");
	УдалитьРеквизиты.Добавить("АбонентскаяПлата");
	УдалитьРеквизиты.Добавить("СтоимостьЧасаРабот");     
	
	ИзменитьРеквизиты(,УдалитьРеквизиты);    
	
КонецПроцедуры	

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание") Тогда 
		ДобавитьДополнительныеРеквизиты();   
	Иначе	  
		УдалитьДополнительныеРеквизиты();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание") Тогда 
		ДобавитьДополнительныеРеквизиты();
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Процедура ПриИзмененииДатаС()    
	Объект.ВКМ_ДатаС = Дата(Элементы.ПолеДатаС.ТекстРедактирования);	
КонецПроцедуры	    

&НаКлиенте
Процедура ПриИзмененииДатаПо()    
	Объект.ВКМ_ДатаПо = Дата(Элементы.ПолеДатаПо.ТекстРедактирования);	
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииАбонентскаяПлата()    
	Объект.ВКМ_АбонентскаяПлата = Число(Элементы.ПолеАбонентскаяПлата.ТекстРедактирования);	
КонецПроцедуры	

&НаКлиенте
Процедура ПриИзмененииСтоимостьЧасаРабот()    
	Объект.ВКМ_СтоимостьЧасаРабот = Число(Элементы.ПолеСтоимостьЧасаРабот.ТекстРедактирования);	
КонецПроцедуры	


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.АбоненскоеОбслуживание") Тогда      
		Если ЭтотОбъект.ДатаС > ЭтотОбъект.ДатаПо Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Проверьте период!";
			Сообщение.Сообщить();               
			
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
///// ВКМ_ )
